CompositeF/test/TestWrong/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pres="PrestaTable_iep">
  <soapenv:Body>
    <pres:RecordsBatch_MsgObj>
      <!--Zero or more repetitions:-->
      <Records_MsgObj>
        <Name>ET</Name>
        <Email>et@hotmial.com</Email>
        <Product>Bicyle</Product>
        <Shop>Json</Shop>
      </Records_MsgObj>
      <Records_MsgObj>
        <Name>ET</Name>
        <Email>et1@hotmial.com</Email>
        <Product>Bicyle</Product>
        <Shop>Json</Shop>
      </Records_MsgObj>
      <Records_MsgObj>
        <Name>ET</Name>
        <Email>et2@hotmial.com</Email>
        <Product>Bicyle</Product>
        <Shop>Json</Shop>
      </Records_MsgObj>
    </pres:RecordsBatch_MsgObj>
  </soapenv:Body>
</soapenv:Envelope>